#include "main information.h"

//Конструктор информация_о_курсе без параметров
информация_о_Курсе::информация_о_Курсе()
{
	курс = "";
	номер_Курс = 0;
}
//Конструктор информация_о_курсе
информация_о_Курсе::информация_о_Курсе(string курсNew, int номер_курсNew)
{
	курс = курсNew;
	номер_Курс = номер_курсNew;
}
информация_о_группе::информация_о_группе()
{
	группа = "";
	номер_группы = 0;
	номер_курса = 0;
}
информация_о_группе::информация_о_группе(string группаNew, int номер_группыNew, int номер_курсNew)
{
	группа = группаNew;
	номер_группы = номер_группыNew;
	номер_курса = номер_курсNew;

}
информация_о_студеите_и_аттест::информация_о_студеите_и_аттест()
{
	студент = "";
	аттестация = "";
	номер_студента = 0;
	номергруппы = 0;
}
информация_о_студеите_и_аттест::информация_о_студеите_и_аттест(string студентNew, string аттестацияNew, int номер_студентаNew, int номергруппыNew)
{
	аттестация = аттестацияNew;
	студент = студентNew;
	номер_студента = номер_студентаNew;
	номергруппы = номергруппыNew;
};

//Конструктор без параметров
List_of_курс::List_of_курс()
{
	data = информация_о_Курсе();
	next = NULL;
	prev = NULL;
}
List_of_курс::List_of_курс(информация_о_Курсе dataNew, List_of_курс* nextNew, List_of_курс* prevNew)
{
	data = dataNew;
	next = nextNew;
	prev = prevNew;
}

List_of_групп::List_of_групп()
{
	data = информация_о_группе();
	next = NULL;
	prev = NULL;
}
List_of_групп::List_of_групп(информация_о_группе dataNew, List_of_групп* nextNew, List_of_групп* prevNew)
{
	data = dataNew;
	next = nextNew;
	prev = prevNew;
}
List_of_студентов_и_аттест::List_of_студентов_и_аттест()
{
	data = информация_о_студеите_и_аттест();
	next = NULL;
	prev = NULL;
}
List_of_студентов_и_аттест::List_of_студентов_и_аттест(информация_о_студеите_и_аттест dataNew, List_of_студентов_и_аттест* nextNew, List_of_студентов_и_аттест* prevNew)
{
	data = dataNew;
	next = nextNew;
	prev = prevNew;
}
